package Documentation;

public class Documentation {
        /**
         * Содержимое пакета LessonOne - решение первого домашнего задаиня.
         *
         * 1. Добавить класс Team, который будет содержать:
         * название команды;
         * массив из четырех участников;
         * метод для вывода информации о членах команды, прошедших припятствия;
         * метод вывода информации обо всех членах команды.
         *
         * 2. Добавить класс Course (полоса препятствий), в котором будут находиться:
         * массив препятствий;
         * метод, который будет просить команду пройти всю полосу.
         */

        /**
         * Содержимое пакета LessonTwo - решение второго домашнего задаиня.
         *
         * 1. Напишите метод, на вход которого подаётся двумерный строковый массив размером 4х4.
         * При подаче массива другого размера необходимо бросить исключение MyArraySizeException.
         *
         * 2. Далее метод должен пройтись по всем элементам массива, преобразовать в int и просуммировать.
         * Если в каком-то элементе массива преобразование не удалось
         * (например, в ячейке лежит символ или текст вместо числа),
         * должно быть брошено исключение MyArrayDataException с детализацией,
         * в какой именно ячейке лежат неверные данные.
         *
         * 3. В методе main() вызвать полученный метод,
         * обработать возможные исключения MyArraySizeException и
         * MyArrayDataException и вывести результат расчета.
         */


}
