package Documentation;

public class Documentation {
        /**
         * Содержимое пакета LessonOne - решение первого домашнего задания.
         *
         * 1. Добавить класс Team, который будет содержать:
         * название команды;
         * массив из четырех участников;
         * метод для вывода информации о членах команды, прошедших припятствия;
         * метод вывода информации обо всех членах команды.
         *
         * 2. Добавить класс Course (полоса препятствий), в котором будут находиться:
         * массив препятствий; (ЭТО Я НЕ СДЕЛАЛА!!! ВМЕСТО ЭТОГО ЕСТЬ ПРОСТО ПРИАЯТСТВИЯ)
         * метод, который будет просить команду пройти всю полосу.
         */


}
